Revit 2024 API
ModelCurveArrArray.ReverseIterator Method
Retrieve a backward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual ModelCurveArrArrayIterator ReverseIterator()
Visual Basic
Public Overridable Function ReverseIterator As ModelCurveArrArrayIterator
Visual C++
public:
virtual ModelCurveArrArrayIterator^ ReverseIterator()
Return Value
Returns a backward moving iterator to the array.
See Also
ModelCurveArrArray Class
Autodesk.Revit.DB Namespace